<template>
  <div>
    <ShortStatistic :cards="statistic_cards"/>
    <FeaturesTree :features="features"/>
    <Description :description="description" :img="description_img"/>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue'
import FeaturesTree from './components/FeaturesTree.vue'
import ShortStatistic from './components/ShortStatistic.vue'
import Description from './components/Description.vue'

export default defineComponent({
  name: 'LearnMS',
  components: {
    FeaturesTree,
    ShortStatistic,
    Description
  },
  data: () => ({
    features: {
      value: 'Возможности',
      children: [
        {
          value: 'Студенты',
          children: [
            { value: 'Просмотр расписания' },
            { value: 'Прохождение тестирования анкетирования' },
            { value: 'Отправка домашней работы на проверку преподавателем' },
            { value: 'Доступ к учебным материалам по всем курсам' },
            { value: 'Доступ к журналам посещаемости' },
            { value: 'Доступ к приказам' },
            { value: 'Запрет на использование системы в случае не оплаты или недопуска' },
            { value: 'Оценка действующих преподавателей и курсов' },
            { value: 'Доступ к электронным ведомостям' },
            { value: 'Доступ к личной информации и документам' },
            { value: 'Доступ к уведомлениям (персональным и групповым)' },
            { value: 'Подключения в комнаты при дистанционном формате' }
          ]
        },
        {
          value: 'Преподаватели',
          children: [
            { value: 'dsds' }
          ]
        },
        {
          value: 'Администраторы',
          children: [
            {
              value: 'Учебно методический отдел',
              children: [
                { value: 'Управление курсами' },
                { value: 'Автоматизированное составление расписания' },
                { value: 'Контроль за нагрузками преподавателей' },
                { value: 'Контроль за пересечениями занятий' },
                { value: 'Экспорт расписания Excel' }
              ]
            },
            {
              value: 'Инспекционный отдел',
              children: [
                { value: 'Online Контроль проведения знятий' },
                { value: 'Составление табеля отведенных занятий' },
                { value: 'Контроль заполняемости ведомостей преподавателями' },
                { value: 'Контроль посещаемости студентов' }
              ]
            },
            {
              value: 'Деканат',
              children: [
                { value: 'Управление студентами' },
                { value: 'Создание рапортов на приказы' },
                { value: 'Составление рейтингов студентов' }
              ]
            }
          ]
        },
        {
          value: 'Абитуриенты',
          children: [
            { value: 'Электронная подача заявок' },
            { value: 'Сдача вступительных экзаменов' },
            { value: 'Исправление документов/заявки если отклонена' },
            { value: 'Просмотр расписания' },
            { value: 'Публичный QR код для мониторинга статуса абитуриента' },
            { value: 'Получение admission letter на почту' }
          ]
        },
        {
          value: 'Контрактеры',
          children: [
            { value: 'dsds' }
          ]
        }
      ]
    },
    statistic_cards: [
      {
        title: 'Организации',
        icon: '/img/app_icons/bank.svg',
        statistic: [
          {
            name: 'Количество Пользователей',
            value: 5578
          },
          {
            name: 'Количество Групп',
            value: 339
          },
          {
            name: 'Успешных аккредитаций',
            value: 12
          },
          {
            name: 'Организаций подключено',
            value: 3
          }
        ]
      },
      {
        title: 'Расписание',
        icon: '/img/app_icons/book-opened.svg',
        statistic: [
          {
            name: 'Ячеек рассписания',
            value: 5815
          },
          {
            name: 'Посещаемостей',
            value: 493191
          },
          {
            name: 'Домашних работ',
            value: 7622
          },
          {
            name: 'Учебных материалов',
            value: 4816
          }
        ]
      },
      {
        title: 'Учебные потоки',
        icon: '/img/app_icons/presentation.svg',
        statistic: [
          {
            name: 'Банк вопросов',
            value: 48172
          },
          {
            name: 'Тестов пройдено',
            value: 91314
          },
          {
            name: 'Оценок выставлено',
            value: 39276
          },
          {
            name: 'Учебных потоков',
            value: 204
          }
        ]
      }
    ],
    description: 'АСУ «LearnMS» (Learning management system) – Автоматизированная web-система управления образовательным процессом.<br>' +
      'АСУ «LearnMS» создана для связывания участников образовательного процесса, его планировании и реализации мероприятий по контролю знаний и контролю самого образовательного процесса всеми его участниками.<br>' +
      'Система включает в себя следующие компоненты:<br>' +
      '•  Инструменты работы с расписанием (пересечения, потоки, нагрузки, экспорт, учебные планы, курсы и т.д.)<br>' +
      '•  Автоматизированное составление расписания<br>' +
      '•  Создание, отправка и контроль аттестационных работ<br>' +
      '•  Ведение электронных журналов и ведомостей студентов<br>' +
      '•  Обеспечение дистанционного образовательного процесса<br>' +
      '•  Инспекции преподавателей и составление табелей<br>' +
      '•  Гибкая система тестирования и анкетирования <br>' +
      '•  Внесение платежей и допуск к обучению студентов<br>' +
      '•  Материалы по курсам (электронная библиотека)<br>' +
      '•  Подсистема инвентаризации организации<br>' +
      '•  Центр уведомлений пользователей<br>' +
      '•  Гибкая система прав административных отделов<br>' +
      '•  Создание различных рейтингов и отчетов по студентам<br>' +
      '•  Генерация документов (списки пользователей, табеля, нагрузки, Admission letter, транскрипты, рейтинги, результаты тестов и т.д.) в Excel, Word, Pdf, Zip, Json <br>' +
      '•  Взаимоконтроль всех участников учебного процесса<br>' +
      '•  Подробная подсистема журналов логов пользователей<br>' +
      '•  Управление академическим календарем<br>' +
      '•  Электронная подача документов и заявок на поступление<br>' +
      '•  Рассылка электронных писем пользователям<br>' +
      '•  Подсистема приказов студентов (рапорта, генерация, приказы, привязка студентов, выписки из приказов)<br>' +
      '•  Гибкая система конфигурации системы организацией.<br>' +
      '•  Внесение данных (ведомости, банк вопросов, пользователи, учебные планы и т.д.) файлами Excel<br>' +
      '•  Мультиязычность (с неограниченной возможностью расширения количества языков)<br>',
    scientific_papers: [
      {
        title: 'Разработка системы управления образовательным процессом',
        link: 'https://www.researchgate.net/publication/344100000_Razrabotka_sistemy_upravleniya_obrazovatel_nym_protsessom',
        img: require('@/assets/img/projects/learnms/learnms.webp'),
      },
    ],
  })
})
</script>
